Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.RadiusTooSmall
Radius is too small.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.IdenticalGeometryCopiesInArray
This array contains multiple copies of some identical geometry. Performance might be improved by using a nested family and arraying copies of its instances.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CouldntFindNewHostsForElements
Couldn't find new hosts for elements in array.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ConstraintsNotSatisfied
Constraints are not satisfied

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CannotCreateArraySelectionIsGrouped
Can't create an array because the selection cannot be grouped.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayingNotSupportedForElements
Arraying is not currently supported for the selected elements.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsWarning
You have selected a mixture of modeling and view specific elements to array in an associative manner.  Only the model elements will remain grouped and associative.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsCorruption
Unable to array this mixture of modeling and view specific elements.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures
Failures about Arrays.